// створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
//
// let numbers = [23, 453, 67, -191, 3];
// console.log(numbers);
// let str = ['mariia', 'vitaliy', 'red', 'one', 'green'];
// console.log(str);
// let mix = [55, 'vitaliy', 77, 'one', true];
// console.log(mix);

// -- Створити пустий масив. Наповнити його будь-якими
// значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// let empty = [
//
// ];
// empty.push('cat', 'dog', 777, true);
// console.log(empty [0]);
// console.log(empty [1]);
// console.log(empty [2]);
// console.log(empty [3]);

// // - За допомогою циклу for і document.write()
// // вивести 10 блоків div c довільним текстом всередині
//
// for (let start = 0; start < 10; start++) {
//     document.write('<div>91 день осени. У кого-то эта пора ' +
//         'ассоциируется с наступающими холодами, плохой погодой и ' +
//         'надоедливыми дождями. А для кого-то это же время ' +
//         'ассоциируется с теплым светом заходящего солнца, ' +
//         'уютными домашними вечерами и коврами из разноцветных ' +
//         'листьев в парках.</div>')
// }

// - За допомогою циклу for і document.write() вивести
// 10 блоків div c довільним текстом і індексом всередині
//
// for (let start = 0; start < 10; start++) {
//     document.write( '<div> Пасмурным осенним утром лучше бы ' + start +' '+
//         'подольше не вылезать из постели, спать и видеть сны, ' +
//         'а выспавшись, потребовать у любимого человека ' +
//         'прямо в кровать чашку горячего кофе..</div>')
// }

// - За допомогою циклу while вивести в документ
// 20 блоків h1 c довільним текстом всередині.
// //
// let start = 0;
// while (start<20) {
//     document.write(`<h1>Аромат осени будто составляли
//         лучшие парфюмеры мира. Только подумайте:
//         нотки поздних цветов, насыщенный аромат рябины,
//         подмороженной первыми заморозками, петрикор —
//         запах земли после дождя, влажного асфальта и
//         оттенок свежего горячего шоколада из кофейни напротив.
//         Человек, который запечатлит это в духах будет
//         по меньшей мере гением.</h1>`)
//     start++;
// }

// - За допомогою циклу while вивести в документ
// 20 блоків h1 c довільним текстом і індексом всередині.
//
// let start2 = 0;
// while (start2<20) {
//     document.write(`<h1>Аромат осени будто составляли
//         лучшие парфюмеры мира. Только подумайте:
//         нотки поздних цветов, насыщенный аромат рябины,
//         подмороженной первыми заморозками, петрикор —
//         запах земли после дождя, влажного асфальта и
//         оттенок свежего горячего шоколада из кофейни напротив.
//         Человек, который запечатлит это в духах будет
//         по меньшей мере гением. ${start2}</h1>`)
//     start2++;
// }

// - Створити масив з 10 числових елементів.
// Вивести в консоль всі його елементи в циклі.
//
// let number = [12, 255, 166, 456, 777, 753, -199, 112233, 2, 88];
// for (let z of number){
//     console.log(z);
// }

// - Створити масив з 10 строкрових елементів.
// Вивести в консоль всі його елементи в циклі.
//
// let user = ['Ket', 'Mari', 'Ivan', 'Sofi', 'Eva', 'Ken', 'Vlad', 'Bred', 'Serg', 'Filip'];
// for (let value in user){
//     console.log(user[value]);
// }

// - Створити масив з 10 елементів будь-якого типу.
// Вивести в консоль всі його елементи в циклі.
//
// let user = ['Ket', 'Mari', 786, true, 'Eva', -991, 'Vlad', 0, 'Serg', false];
// for (let value in user){
//     console.log(user[value]);
// }

// - Створити масив з 10 елементів числового,
// стірчкового і булевого типу. За допомогою if
// та typeof вивести тільки булеві елементи
//
// let user = ['Ket', 'Mari', 786, true, 'Eva', -991, 'Vlad', 0, 'Serg', false];
// for (let z of user) {
//     if (typeof z === 'boolean') {
//         console.log(z);
//     }
// }

// - Створити масив з 10 елементів числового,
// стірчкового і булевого типу. За допомогою if
// та typeof вивести тільки числові елементи
//
// let user = ['Ket', 'Mari', 786, true, 'Eva', -991, 'Vlad', 0, 'Serg', false];
// for (let z of user) {
//     if (typeof z === 'number') {
//         console.log(z);
//     }
// }

// - Створити масив з 10 елементів числового,
// стрічкового і булевого типу. За допомогою if
// та typeof вивести тільки рядкові елементи
//
// let user = ['Ket', 'Mari', 786, true, 'Eva', -991, 'Vlad', 0, 'Serg', false];
// for (let z of user) {
//     if (typeof z === 'string') {
//         console.log(z);
//     }
// }

// - Створити порожній масив. Наповнити його
// 10 елементами (різними за типами) через
// звернення до конкретних індексів. Вивести в
// консоль всі його елементи в циклі.
//
// let all = [
//
// ];
// all.push ('Ket', 'Mari', 787, true, 'Eva', -891, 'Vlad', 8, 'Serg', false);
// for (let i=0; i<all.length; i++){
//     console.log(all[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
//
// for (let i=0; i<10; i++) {
//     console.log(i);
//     document.write(i);
//     debugger;
// }

// - Створити цикл for на 100 ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
//
// for (let i=0; i<100; i++) {
//     console.log(i);
//     document.write(i);
//     debugger;
// }

// - Створити цикл for на 100 ітерацій з кроком 2.
// Вивести поточний номер кроку через console.log та document.write
//
// for (let i=0; i<100; i+=2) {
//     console.log(i);
//     document.write(i);
//     debugger;
// }

// - Створити цикл for на 100 ітерацій.
// Вивести тільки парні кроки. через console.log + document.write
//
// for (let i=0; i<100; i+=2) {
//     console.log(i);
//     document.write(i);
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки.
// через console.log + document.write
//
// for (let i=0; i<100; i+=2) {
//     console.log(i);
//     document.write(i);
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки.
// через console.log + document.write
//
// for (let i=1; i<100; i+=2) {
//     console.log(i);
//     document.write(i);
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини
// (2 цикли! 1й - хвилини, 2й - секунди)
//
// for (let i=0; i<2; i++) {
//     for (let k=0; k<60; k++)
//     {
//         console.log(i, k);
//     }
// }

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини
// (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
//
// for (let i=0; i<2; i++) {
//     for (let k=0; k<20; k++) {
//         for (let j = 0; j < 60; j++) {
//             console.log(i, k, j);
//         }
//     }
// }

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for
// зібрати всі букви в слово.
//
// let letters = ['a', 'b', 'c'];
// for (i=0; i<letters.length; i++){
//     document.write(letters[i]);
// }

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while
// зібрати всі букви в слово.
//
// let letters2 = ['a', 'b', 'c'];
// let i = 0;
// while (i < letters2.length){
//     document.write(letters2[i]);
//     i++;
// }

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of
// зібрати всі букви в слово.
//
// let letters3 = ['a', 'b', 'c'];
// for (let z of letters3){
//     document.write(z);
// }

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in
// зібрати всі букви в слово.
//
// let letters4 = ['a', 'b', 'c'];
// for (let z in letters4){
//     document.write(letters4[z]);
// }

// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець
// елементи 1, 2, 3 за допомогою циклу.

let abc = ['a', 'b', 'c'];
abc.push(1, 2, 3);
console.log(abc);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент
// за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент
// за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice
// перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice
// перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice
// перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice
// зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice з
// робіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль
// тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній
// масив. За допомогою будь-якого циклу та push () скопіювати
// значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній
// масив. За допомогою будь-якого циклу скопіювати значення
// одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа
// тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа
// тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в
// зворотньому циклі (с заду на перед)
// 10. створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1. створити пустий масив та :
// -заповнити його 50 парними числами за допомоги циклу.
// -заповнити його 50 непарними числами за допомоги циклу.
// -используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний
// с права элемент - парный

// 6. масив з числами [100,250,50,168,120,345,188],
// Які характеризують вартість окремої покупки.
// обрахувати середній чек.

// 7. створити масив з рандомними значеннями,
// помножити всі його елементи на 5 та перемістити їх в інший масив.

// 8. створити масив з будь якими значеннями
// (стрінги, числа, і тд...). пройтись по ньому, і
// якщо об_єкт є числом, додати його в інший масив.